Tutorials/Case13/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topandbottom
    {
        type            zeroGradient;
    }
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate     0.000001;
        value           uniform (0 0 0);  
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type             empty;
    }
}


// ************************************************************************* //

